Revit 2027 API
ScheduleDefinition.CanFilterByGlobalParameters Method
 Checks whether a field can be used with a global parameter-based filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanFilterByGlobalParameters(
	ScheduleFieldId fieldId
)
Public Function CanFilterByGlobalParameters (
	fieldId As ScheduleFieldId
) As Boolean
public:
bool CanFilterByGlobalParameters(
	ScheduleFieldId^ fieldId
)
member CanFilterByGlobalParameters :
        fieldId : ScheduleFieldId -> bool
Parameters
fieldId ScheduleFieldId
 The ID of the field to check.
Return Value
Boolean
 True if the field can be used with a global parameter-based filter, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  fieldId is not the ID of a field in this ScheduleDefinition.
ArgumentNullException |  A non-optional argument was null
Remarks
The global parameter-based filter types are IsAsociatedWith, IsNotAssociatedWith.
Only parameters which have a compatible type with at least one existing global parameter can be filtered.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace